<!DOCTYPE html>
<html lang="ru">
<head>
<meta charset='utf-8'>
</head>
<body>
<?php
function transliterate($st) {
	 
	$pattern = ['а', 'б', 'в', 'г', 'д', 'е', 'ж', 
	            'з', 'и', 'й', 'к', 'л', 'м', 'н', 
				'о', 'п', 'р', 'с', 'т', 'у', 'ф', 
				'ы', 'э','e', 'x', 'ц', 'ч', 'ш',
	            'щ', 'ъ', 'ь', 'ю', 'я', 
				
				'А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ж', 
				'З', 'И', 'Й', 'К', 'Л', 'М', 'Н', 
				'О', 'П', 'Р', 'С', 'Т', 'Ф', 'Ы', 
				'Э', 'Е', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 
				'Ъ', 'Ь', 'Ю', 'Я'];
				
	$replace = ['a', 'b', 'v', 'g', 'd', 'e', 'g', 
	            'z', 'i', 'y', 'k', 'l', 'm', 'n', 
				'o', 'p', 'r', 's', 't', 'u', 'f', 
				'y', 'e',  'yo', 'h', 'ts', 'ch', 
				'sh', 'shch', '', '', 'yu', 'ya',
				
				'A', 'B', 'V', 'G', 'D', 'E', 'G', 
				'Z', 'I', 'Y', 'K', 
				'L', 'M', 'N', 'O', 'P', 'E', 'S', 
				'T', 'U', 'F', 'Y', 'E', 'Yo', 'H', 
				'Ts', 'Ch', 'Sh','Shch', '', '', 'Yu', 
				'Ya'];
	
	
	return str_replace($pattern, $replace, $st);
}
echo transliterate("Жизн очень короткая надо сенить...");
	
	
?>
</body>
</html>